Revit 2024 API
Camera Methods
The Camera type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Transform
 Transforms the camera
See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace